Repository: bibleexchange/courses
Catalog: _8_doctrine-1/tm/_trans-level2.tmx
Source language: en_us
Languages: sw

source: Is evolution a scientifically proven fact?No, it is a theory.
sw: Maendelon zimehakikishwa ni mambo kwenye kuakikishwa katika manifa?Siyo (Hamma), ni mafundisho.

source: Eoathropus dawsoni— Piltdown Man — From one piece of jaw, one piece of skull, one canine tooth, two molar teeth, and one nasal bone. Applying the chemical dying process proved the jawbone does not belong to this skull at all.
sw: Eoathropus dawsoni&mdash; Mtu wa altdown&mdash; Kutokea kwa sehemu kimoja cha mfupa wa kinwa, sepremu kimoja cha mfupa wa kichwa, jino moja ya mbele, meno mbili ya mwisho, na mfupa moja wa pua. Wakati ili hunzwa kar njinya laboratory ilionyesha kwamba hiyi mfupa wa kinwa haikumbatane vizuri na mfupa wa kichwa.

source: Hesperopithecus— Harold Cocki — Nebraska Man — This model was constructed from one tooth that was discovered which eventually proved to be from a pig.
sw: Hesperopithecus&mdash; Harold Cocki&mdash; Mtu wa Nebroska&mdash; Hiyi mfano ili undwa kutokea kwa jino moja amboyo ili fumbuliwa na kuhakikisha kutokea kwenye nguruwe.

source: Homo erectus— Heidelberg Man — Again, an entirediagram of a complex creature of hundreds of moving parts totally reconstructed from the exhaustive resource of onejawbone found in the sands of Germany.
sw: Homo erectus&mdash; Mtu wa Heidelberg&mdash; Tena picha mzima ya umbo ngumu ya miya ya sehemu yenye kutikisika na kuundwa kutokea kwa tabu ya kupata mfupa wa kinwa ambayo ilipatikana kwenye mchanga wanchi Germany.

source: Homo neanderthalensis— Neanderthal Man — Germany — Constructed from partof a skull, thighbone, one rib fragment. Scientists could not agree on the findings if they were even from the same body.
sw: Homo neanderthalensis&mdash; Mtu wa Neanderthal&mdash; Katika nshi Germany&mdash; aliundwa kutokea kwa sehemu ya mfupa wa kichwa mfupa wa paya, na sehemu moja ya ubavu. Watu wenye elimu hawakuweze kukubali hiyo amboyo ili fumbuliwa ingawa walikuwa kwa mwili moja.

source: Pithecanthropus erectus— “The ape man who walked erect” Known as the Java Man — The entire model was constructed from only a piece of skull, two teeth, and one thighbone. 10 scientists said they were the bones of an ape; 7 said they were the bones of a man. 7 others said they were a “missing link” in the chain of evolution!
sw: Pithecanthropus erectus&mdash; &ldquo;Mtu……ape? Alikuwa ametembea myenye kusimama&rdquo;. Mwenye kujulikana kama mpu wa JAVA&mdash; Hiyo mfano mzima iliundwa kutokea kwa sehemu moja ya mfupa wa kichwa, meno mbili na mfupa moja wa paya. Watu kumu wenye elimu walisema ilikuwa mufupa za …..? an ape; saba walisema ilikuwa mifupa ya mtu. Saba wengine walisema ilikuwa ungano yenye ku toweka &ldquo;katika mnyororo za maendeleo!

source: A class of plants or animals which have characteristic properties in common and can be indefinitely propagated without changing those characteristics.
sw: Haina za mapando na wanyama wenye kuwa na ufanonisho umoja na wamezorabila mwisho mahali pote bila mabadiliko lolote za haina.

source: A plan without a planner? How would there be nothing and then suddenly something? The existence, beauty, immensity and order of our universe is evidence enough of a Designer at work and not mere coincidence.
sw: Mpango bila mwenye kupanga? Vipi kulikuwako tupu na kiisha mara kumetuwako kitu? Kuwa, urembo, upana na utaratibu wa ulimwengu wetu ni akikisho yenye kutosha ya mwenye kuumba mwenye kuwa kwa kazi na siyo ubahatisho.

source: AIR — Just the right amount of oxygen is present in the air so that if any was added or taken away, life could not exist on earth.
sw: AIR – hewa kamili za pumzi zimkuwamo katika hewa ili kusudi kamazingine ziméongeka ao kupungugwa maisha inge shindikana udongoni.

source: Anthropology: The Doctrine of Man
sw: Anthropology: Mafundisho kuhusu Mtu

source: Dictionary Definition of Doctrine –
sw: Ufasisiyo ya mafundisho kamusini (dictionary) –

source: Doctrine 1
sw: Mafundisho I

source: Dogma is man’s statement of the truth set forth in a creed; while, doctrine is the fundamental truths of the Bible arranged in a systematic form. EXAMPLE: The Roman Catholic Church instructs men to call the pope Holy Father (dogma), whereas the Bible says in Matthew 23:9 “call no man your father”. (doctrine). The very context of Christ’s command is addressing the pride and arrogance of men that usurp honor and recognition that is not their own to claim. “Our source is not in man, but is in God” is the principle Christ is emphasizing. The false doctrine that prefaces this particular dogma is that the pope is literally Christ on the earth. Pope Pius X (1903-1914) is quoted in a sermon on the authority of the pope:
sw: Dogma ni maneno ya kweli kutokea kwa mtu yenye kudhihirishwa kwa namna ya kusadiki, bali doctrine ni kweli wa ndani katika bibkia wenye kutungwa kwa ambinu. Kwa Mfano: kanisa ya katolika ya Rumi imeagiza watu kumwita pape &ldquo;Baba Mtakatifu&rdquo; (dogma), bali biblia imesema katika injili ya Mathayo Mtakaatifu sura yake ishirini na tatu, shairi ya tisa: Msimwite mtu Baba duniani. (doctrine). Maana kamili ya mafundisho ya kristo ni kuhusu kiburi na majivu ya watu ambaye wamepotonya ustahivu na shukrani isiyo kuwa ya kwao kwa kujipendelea wenyewe. Mwanza wetu siyo kwa mtu, bali kwa Mungu kwenye na fundisho ambayo Kristo ametetea. Mafundisho danganifu imetoa hiyo dogma kwamba Pape ndiye Kristo duniani. Pope Pius (ambae ali kuwako toka mwaka 1903 hadi 1914) aliiga kusema katika mafundisho kuhusu mamlakon ya Pope:

source: EARTH — Job 12:8 “Speak to the earth, and it shall teach thee.” The earth is spinning in four directions at least all at once.
sw: UDONGO&mdash; Yobo 12:8 &ldquo;Sungunza na udongo, na itakufundishwa&rdquo;. Udondo imezunguka katika njia nne kwa mara moja ao zaidi yake.

source: Evolution versus Special Creation
sw: Maendeleo kufika kwenye umbo za tofauti (upekee)

source: Example — A dog will react to a whistle that we cannot hear.
sw: Kwa mfano&mdash; Mbwa atajibu kwa pyororo ambayo hatuzi kusikia.

source: First Year
sw: Mwaka la Kwanza

source: Genesis 1:26 says man was created in the image of God. To what does this “image” and “likeness” refer?
sw: Mwanzo 1:26 imesema kwamba aliumbwa kwa mfano wake Mungu. Ufananisho na mfano hii imeambatana na nini?

source: How did life begin? Some say a product of evolution. Evolutionists seek to link man with brute beasts, but Jesus Christ came into the world to link man with God. John 1:12; Ephesians 2:15; II Peter 1:4; I John 3:2
sw: Vipi maisha ilianza? Wengi wameshuudia kwamba ni tuda za maendeleo. Wenye kutelea maendeleo wametafuta kuambatanisha mtu na wanyama, walakini Yesu alikuja duniani ili kuambatanisha mtu na Mungu. (Yohana 1:12; Waefeso 2:15; II Petro 1:4; I Yohana 3:2)

source: However, we must be careful to remember that while God is capable of assuming human form, the essence of His being is Spirit. (John 4:24)
sw: Basi, afadhali ma tufanye angalisho ili kukumbuka kwamba Mungu ana uwezon ya kuivaa hali ya mtu. Undani wa hali yake ni Roho. (Yohana 4:24)

source: If living organisms can be paired together and so propagate indefinitely a fertile offspring, they are of the same species.
sw: Ikuwa viumbe vyenye uhai vimeweza kumbatana pamoja na hivi bila mwisho uzao wenye kuwa najiusi ya kuzao; vinatawanyisha kumbe vimekuwa vya haina moja.

source: It has reference particularly to a moral and intellectual likeness. The following passages speak of the “image” of God in respect to knowledge and righteousness. (Ephesians 4:23; Colossians 3:10; 2 Corinthians 3:18)
sw: Imeambatana na ufananisho wa mwendo wa elimu. Maandiko ijayo imesungumzia &ldquo;mfano&rdquo; wa mungu kuhusu ufahamu na uhaki. (Wrefeso 4:23; Wakolosai 3:10; 2 Wakorinto 3:18)

source: Let&apos;s take a look at some of the Darwinian “scientific method” at work! Consider if you could recognize any of your deceased relatives if you were give as scant evidence as we see below. THE MISSING LINKS:
sw: Tutazame kwanza matendo ya badhi ya mbinu ya maarifa kama bile bwana Darwin alitumia! Tafakari kama umeweza kuwafahamu wazazi wako fuluni ambaye wamekuisha katoweka kama ulipewa hakikisho ndoyo kama hivyo tumeyaona katika mafundisho ifwatayo. MAUNGANO YENYE KUTOWEKA.:

source: Life did not come by human nature evolving into the Divine, but by the Divine entering into human nature.
sw: Maisha haitoki kwa maumbile ya uutu yenye kuambatana na umungu, bali imetoka kua ya Umungu yenye kunigizana katika uutu.

source: MOON — If it was any closer, huge tidal waves would engulf us.
sw: MWEZI&mdash;Ikawa ilikuwa karibu, mawimbi yenye ukubwa zaidi ingetumeza.

source: Meaning of Doctrine
sw: Maana ya mafundisho

source: OUR HUMAN BODY
sw: MWILI WETU WA UTU

source: Opposed to special creation is the theory of evolution, which teaches that all forms of life developed from one form and that higher species, developed from a lower. So that, for example, what was once a snail became a fish; what was once a fish became a reptile; what was once a reptile became a bird, and what was once an ape became a human being.
sw: Kinyume za umbo za tofauti ni mafundisho za maendeleo, ambayo imefundisha halizote za maisha yenye kupata maendeleo tangu hali moja na hiyo na haina ya hali za juu zaidi, yenye kupata maendeleo kutoka kwa ma traina za chini zoudi. Ili kusudi, kwa mfano, ile iliyo kuwa gorogoro ili kwa samaki; ile iliyokuwa samaki, ilikuwa wanyama wenye kutamboa; ile iliyokuwa wanyama wenye kutamboa ilikuwa ndege, ne ile iliyokuwa apepe ili kuwa mtu.

source: Reasons there is a God and Evolution is a Lie
sw: Sababu ya kuwako kwa Mungu na Mwendeleo ni Uongo

source: STARS — Our solar system with its sun, and planets, the Milky Way, is composed of 100 billion stars each with their own planet system. The universe is considered to be infinitely expanding.
sw: NYOTA –Ulimwengu wetu wa jua na jua yake, na ma udongo mbali mbali, imekuwa na billioni miya mojo ya nyota, na kila mmoja na ulimwengu yake ya udongo. Kumbe ulimwengu imejulika kuongezeka bila mwisho.

source: SUN — 10% closer earth would sizzle or if the sun was 10% farther away the earth would freeze. The sun is so big that it could contain 1,300,000 earths.
sw: JUWA&mdash;10% Karibu, udingo unge sugulika ikawa juwa ilikuwa 10% Mbali ya udongo unge kuwa kama barafu. Juwa umekuwa kubwa zaidi hata kuwa 1.300.000 mara ya udongo.

source: Science is the systematic and logical arrangement of certified facts. We describe theology/doctrine as a science because it consists of facts relating to God and Divine things arranged in a systematic and logical order.
sw: Maarifa ni utaratibu kamili na yenye kitungwaa mbinyay yene kuhakikishwa, mambo. Tumefasiria theology (doctrine kma maonifa, kwani imeambatana na maneno kuhusu mungu na vitu takatifu vyenye utaratibu kamili na yenye kufwata mbinu.

source: Special Creation “after his kind” Gen. 1:25
sw: Umbo wa tofauti &ldquo;kwa mfano wake&rdquo; Mwanzo 1:25

source: THE ACORN — Oak tree — The Poet said, “Only God could make a Tree.”
sw: THE ACORN&mdash; Mti wa Oak&mdash;Mtunga shairi alisema &ldquo;Mungu tu ndiye mwenye kuumba mti&rdquo;

source: THE BLOOD — Vessels like an incredibly complex city. Blood cells detect harm and fight off the enemy
sw: DNU&mdash;Kitu kigumu kwa kuelewa. Masehemu za damu zimefumbua ubaya na kuponbansha adui.

source: THE BRAIN — greatest computer —Much of our brain’s potential goes unused.
sw: BONGO&mdash;Kombpyuta yenye ukubwa mno&mdash; shehemu kubwa yenye kazi katika bongo letu alipate matumizi.

source: THE CREATION OF LIFE
sw: UMBO LA MAIFA

source: THE CREATION OF THE UNIVERSE
sw: KUUMBWA KWA ULIMWENGU

source: THE EAR — sound scale — There are sounds in the air that we do not hear, and yet the ear has within it the potential to hear all sounds.
sw: MASIKIYO&mdash; Kipimo cha sauli&mdash; kuna masauti hewani ambayo hatusikie, na japo sikiyo ina ndomi mwake uwezo wa kusikia sauti zote.

source: THE EYE — Transmits sight to the brain which changes the images right side up.
sw: JICHO&mdash;imetoa ono Kyenye bongo ili kusudi iyabadili mapicha kusimama sawa.

source: THE HEART — weighs almost 3 lbs. and pumps enough pressure to lift a battleship or push 100 freight cars down a track.
sw: ROHO&mdash;Ina uzito wa 3lbs., na imetoa mkazo yenye kutosha ili kusudi kunyanyua merikebu mojaza vita ao kusukuma ma gari miya moja yenye shehena kuteremka kwenye barabara.

source: THE NERVES—There are over one billion nerves (main stems, branches and endings) in the human body all managed by one brain.
sw: MISHIPA NDOGO&mdash; Kuna mishipa ndogo zaidi ya bili moja (Mishipa kubwa, viugo na mwisho yao) Katika mwili wa mtu yote yenye kuongozwa na bongo moja.

source: THE RADISH — Black seed — Green leaves — Red coat — White meat.
sw: The RADISH&mdash; Punje nyeusi&mdash;Majani ya kijivu&mdash;jivu&mdash;ngozi nyekundu&mdash;Munyofu nyeupe.

source: THE ROSE — Color — scent, all packed into a tiny seed never gets mixed up.
sw: Uwa&mdash; Rangi&mdash; harufu; yote katika punje ndogo bila kamwe kuchangamana.

source: THE THEORIES OF EVOLUTION
sw: NADHARIA YA MAENDELEO

source: THE WATERMELON — seed reproduces itself 1 million times.
sw: THE WATERMELON&mdash; punje zimezaa pekeyke mara milioni moja.

source: THE WORLD OF NATURE
sw: Mwituni

source: Textbook
sw: Vitabu vya Kiada

source: The dogma of the Roman Catholic church is based on false doctrine and therefore it is false. Doctrine could be understood as “simply what the Bible says” and dogma is man’s conclusions drawn from the text of the Scripture. Dogma can be true, but is not necessarily true.
sw: Dogma ya kanisa za katolika ya Rumi umeketi juu ya mafundisho danganifu, na kumbe, imekuwa ya uongo. Mafundisho imesema &ldquo;na dogma kama neon la mwisho kutokea kwa mtu na yenye kupatikana katika maandikon takatifu. Dogma imeweza kwa kweli, balihaiwezi kwa mara yote kuwa kweli.

source: The Creation of Man. The term special creation refers to the doctrine that all living organisms were created according definite species and that these species will produce after their kind. This principle defies the evolutionary hypothesis that each species is an evolved form of some earlier species. Biblically put, special creation means that all living organisms will produce after his kind. A very simple example of this principle is that when you plant an orange seed, it is most definite that an orange tree will develop and not any other kind of plant (i.e. apples, watermelons, cucumber, etc.).
sw: Kuumbwa kwa Mtu. Tamko &ldquo;umbo wa tofauti&rdquo; imeambatana na mafundisho ya kwamba viumbe vyote vyenye uhai viliumbya kutokana na ma haina Fulani na kwamba hiyo ma haina Fulani ina hali yenye mwendeleo ya ma haina ambayo ili kuako tangu awali. Kutokana na biblia, umbo wa tofauti (upekee) maana viumbe vyote vyenye uhai vitatoa uzao kwa mfano wake. Mfano mwepesi ya hiyo kamuni ni kwamba wakati umepanda punje za njimu, (mekuwa wazi kwamba mti wa njimu zita komaa kusi haina yake tu (kwa mbfano: apples, water melons, cucumber, na kadhalika) (Ndizi, hembe, mapela, muzeituni, na kadhalika).

source: The Image of God
sw: Mfano Ufamruisho wa Mungu

source: The Pope is not simply the representative of Jesus Christ. On the contrary, he is Jesus Christ Himself, under the veil of the flesh, and who by means of a being common to humanity continues His ministry amongst men ... Does the Pope speak? It is Jesus Christ Who is speaking. Does he teach? It is Jesus Christ Who teaches. Does he confer grace or pronounce an anathema? It is Jesus Christ Himself Who is pronouncing the anathema and conferring the grace.
sw: Pope siye tu msimamizi wa Yesu Kristu. Lakini, ni Yesu Kristo mwenyewe, Katika mwili na kwa kuwa mtu kama watu ame fuliza kubimiza kazi zake myongoni mwa watu… </i><i>Pope amesema ? Ndiye Yesu Kristo amenena. Amefundisha ? Ndiye Yesu Kristo amefundisha. Ametoa neema ao laana? Ndiye Yesu Kristo mwenyewe ametoa laana na neema.

source: The human body is incredibly complex and amazing. It begins with the union of two cells and it takes upon itself some 21 trillion other cells (all going to the right places).
sw: Mwili wa utu ni bila shaka ngumu na yenye kuleta mshangao. Imeanza na ambatano wa mbego mbili na imechukua binafsi trilioni ishirini na moja ya mbego nyingine (yote umeeda mahali kamili).

source: The principles, beliefs, or dogma of any church, sect, or party.
sw: mila, imani, soditio, maneno iliyo aminiwa kwa kila kanisa, dhehebu, ao chama

source: The word “doctrine” literally means “teaching” or “instruction” and may be defined as the fundamental truths of the Bible arranged in systematic form. This study is also commonly called theology, which means literally a reasoned discourse about God. Theology or doctrine may be defined as a science which deals with our knowledge of God and His relations with man
sw: Tamko &ldquo;doctrine&rdquo; maona yake mafundisho, na tena imeweza kufasiriwa kama kweli ya ndani katika biblia yenye kutungwa katika utaratibu ya mbinu mafunzo hiyi imcitwa kwa ujumba &ldquo;theology&rdquo;, maana maarifa kamili kuhusu Mungu. Theology ao doctrine lime weza kufasiriwa kama maarifa kuhusu ufahamu wetu wa Mungu na kwambatana kwake Mungu na mtu.

source: Theology is knowledge of God, but religion is the practice of what is known. (John 13:17; James 1:27) You can be a theologian and not at all religious — i.e., not having any genuine spiritual experience.
sw: Theology ni ufahamu kuhusu Mungu, walakini, dini ni mazoezo za hiyo ambayo imefahamika. (John 13:17; james 1:27). Umeweza kuwa mwenye maarifa kamili kuhusu Mungu (theologian), lakini bado haujaambatana na dini-yani, badon haujapata ufahamu kamili za viroho.

source: There are so many gaps and so much supposition in evolution that it cannot be classified as a true science. The gaps in evolution have become known as the “missing links.” It is made up of exaggerated speculation and theories and not “observable facts.” As a matter of fact, Evolution requires so much blind faith of its followers that it is more accurate to describe it as a religion. In the United States, it has become the religion of the State under the guise of “Separation of Church and State.”
sw: Kun swali mengi ambayo imekosa jibu na udhani wengi kuhusu maendeleo ambayo haiwezi kuxhukuliwa kama maarifa halisi. Hiyo ma swali mbali mbali bila jibu imejulikana kama maungano yenye kutoweka. Ime kua fikira yenye kuzidi mno na mafundisho, lakini siyo mambo ambayo imeonekana kwa macho. Kueli, Maendeleo imeomba imani kubwa yenye kuwa bila macho kutokea kwa wafwashi wake ye kwamba imekuwa kuitaja kama dini. Kwenyi USA, imeduwa dini za serkali chini ya uficho ya &ldquo;matengano kati ya kanisa na serkali&rdquo;

source: There may be reference here to physical likeness. There are some who believe that such scriptures as Psalm 17:15 teach that God has a visible form and that man in the garden bore that image. See also Isaiah 6:1 and Acts 7:55,56.
sw: Kumekuwa ambatano na ujananisho wa murlikuna wengine wamedhani kwamba hiyo maandiko, kama Zaburi 17:15 zimefundisha kwamba ana hali yenye kuonekana, hivyo mtu kwenye bustani alichukua kwa mfano wake. Angalia tena katika Isaya 6:1 na Matendo 7:55,56.

source: What is a species?
sw: Haini ni nini?

source: What is a test by which the distinction of species is known?
sw: Ni kwa mashindno gain tofauti ya haina ime julikana?

source: What is the connection between theology and religion?
sw: Ushiritka gain inayopatikana kati ya theology ne dini?

source: What is the difference between a doctrine and a dogma?
sw: Tofauti gain inayopatikana kati ya doctrine na dogma?

source: What the Bible Says About Man, Sin, Salvation and Angels
sw: Biblia inasema nini kuhusu Mtu, Dhambi, Wokovu na Malaika

source: Why do we describe theology or doctrine as a “science”?
sw: Tumefasiria je theology ao doctrine kama marifa?
